# IFCConnectedWallData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCConnectedWallData Members
IFCConnectedWallData Class Methods Properties See Also
---
The IFCConnectedWallData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the IFCConnectedWallData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | The element id to which this element is joined. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Location | The location for the join. |

# See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace